#### AddItem Method

---

|  |
| --- |
| ComboBox Class   See Also |

Adds a new item to the ComboBox.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ComboBoxMember AddItem( 	ComboBoxMemberData memberData ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AddItem ( _ 	memberData As ComboBoxMemberData _ ) As ComboBoxMember ``` |

| Visual C++ |
| --- |
| ``` public: ComboBoxMember^ AddItem( 	ComboBoxMemberData^ memberData ) ``` |

#### Parameters

memberData
:   Type:  Autodesk.Revit.UI ComboBoxMemberData
     An object containing the data needed to construct the ComboBoxMember.

#### Return Value

The newly added ComboBoxMember.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when memberData is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when button with memberData.Name already exists in the drop-down list. |

# See Also

ComboBox Class

Autodesk.Revit.UI Namespace